Public Attributes | List of all members
API_RailingSegmentType Struct Reference
Element Manager
Represents a Railing Segment element. More...
#include <APIdefs_Elements.h>
 Public Attributes
 API_Elem_Head  | head
General element header.
 API_Guid  | owner
GUID of the Railing element owning this Railing Node.
 bool  | visible
True, if the Railing Segment is visible.
 bool  | relativeSkewingAngle
True, if the skew angle of the Railing Segment is relative.
API_RailingRefLineLocationID  | refLineLocation
The location of the segment's reference line |APIRLL_Left|Reference line is on the left| |APIRLL_Center|Reference line is at the centre| |APIRLL_Right|Reference line is on the right|.
 double  | height
The height of the Railing Segment.
 double  | yOffset
Reference line offset.
 double  | zOffset
Railing vertical offset.
 double  | slantAngle
The slanting angle of the Railing Segment.
 double  | skewAngle
The skewing angle of the Railing Segment.
 API_RailingPatternType  | defPattern
The default Railing Pattern element, from which the Railing Pattern instances will be generated.
 API_RailingHandrailType  | defDefaultHandrail
The default Handrail element, from which the upper Handrail instances will be generated.
 API_RailingHandrailType  | defHandrails
The default Handrail element, from which the lower Handrail instances will be generated.
 API_RailingToprailType  | defToprail
The default Toprail element, from which the Toprail instances will be generated.
 API_RailingRailType  | defDefaultRail
The default Rail element, from which the default Rail instances will be generated.
 API_RailingRailType  | defRails
The default Rail element, from which the added Rail instances will be generated.
Detailed Description
Represents a Railing Segment element.
Member Data Documentation
◆ refLineLocation
 API_RailingSegmentType::refLineLocation
The location of the segment's reference line |APIRLL_Left|Reference line is on the left| |APIRLL_Center|Reference line is at the centre| |APIRLL_Right|Reference line is on the right|.